<?php

// ========================================================================== //

function info_module_mod_my_search(){

    //
    // Описание модуля
    //

    //Заголовок (на сайте)
    $_module['title']        = 'Поиск ';

    //Название (в админке)
    $_module['name']         = 'Поиск';

    //описание
    $_module['description']  = 'Поиск костомизированный';

    //ссылка (идентификатор)
    $_module['link']         = 'mod_my_search';

    //позиция
    $_module['position']     = 'search';

    //автор
    $_module['author']       = 'RA';

    //текущая версия
    $_module['version']      = '1.0';

    //
    // Настройки по-умолчанию
    //
    $_module['config'] = array();

    return $_module;

}

// ========================================================================== //

function install_module_mod_my_search(){

    return true;

}

// ========================================================================== //

function update_module_mod_my_search(){

    return true;

}

// ========================================================================== //


